# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\rbeattie_final_project\ConnectFour.cydsn\ConnectFour.cyprj
# Date: Sun, 05 May 2024 21:09:48 GMT
#set_units -time ns
create_clock -name {SampleClk(routed)} -period 22666.666666666664 -waveform {0 11333.3333333333} [list [get_pins {ClockBlock/dclk_4}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {emFile_1_Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 5} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/clk_sync}] -edges {1 25 49} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {Clock_3} -source [get_pins {ClockBlock/clk_sync}] -edges {1 25 49} [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {SampleClk} -source [get_pins {ClockBlock/clk_sync}] -edges {1 545 1089} -nominal_period 22666.666666666664 [list [get_pins {ClockBlock/dclk_glb_4}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for D:\rbeattie_final_project\ConnectFour.cydsn\TopDesign\TopDesign.cysch
# Project: D:\rbeattie_final_project\ConnectFour.cydsn\ConnectFour.cyprj
# Date: Sun, 05 May 2024 21:09:28 GMT
